In [1]:
import pandas as pd

In [2]:
dic_data = {"c0": [1, 2, 3], "c1": [40, 50, 60], "c2": [100, 200, 300]}

In [3]:
pd.DataFrame(dic_data)
#첫번째 열 = index라 함

   c0  c1   c2
0   1  40  100
1   2  50  200
2   3  60  300

In [4]:
df = pd.DataFrame(dic_data)

In [5]:
type(df)

pandas.core.frame.DataFrame

In [13]:
pd.DataFrame([[15, "남", "덕영중"],[17, "여", "수리중"]],
    index=["준서", "예은"],
    columns=["나이", "성별", "학교"]
)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [14]:
df = pd.DataFrame([[15, "남", "덕영중"],[17, "여", "수리중"]],
    index=["준서", "예은"],
    columns=["나이", "성별", "학교"]
)

In [15]:
df.index

Index(['준서', '예은'], dtype='object')

In [16]:
df.columns

Index(['나이', '성별', '학교'], dtype='object')

In [17]:
df.index=["학생1", "학생2"]

In [18]:
df

     나이 성별   학교
학생1  15  남  덕영중
학생2  17  여  수리중

In [19]:
df.columns = ["연령", "남녀", "소속"]

In [20]:
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [21]:
df.rename(columns={"소속":"소속학교"})

     연령 남녀 소속학교
학생1  15  남  덕영중
학생2  17  여  수리중

In [22]:
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [23]:
df.rename(columns={"소속":"소속학교"}, inplace=True)

In [24]:
df

     연령 남녀 소속학교
학생1  15  남  덕영중
학생2  17  여  수리중

In [25]:
df.rename(index={"학생2":"전학생"}, inplace=True)

In [26]:
df

     연령 남녀 소속학교
학생1  15  남  덕영중
전학생  17  여  수리중

In [27]:
exam_data = {
    "수학": [100, 100, 100],
    "영어": [90, 91, 92],
"음악": [1, 2, 3],
"체육": ["P", "F", "P"]}

In [28]:
pd.DataFrame(exam_data)

    수학  영어  음악 체육
0  100  90   1  P
1  100  91   2  F
2  100  92   3  P

In [29]:
pd.DataFrame(exam_data, index=["서준", "우연", "인아"])

     수학  영어  음악 체육
서준  100  90   1  P
우연  100  91   2  F
인아  100  92   3  P

In [30]:
df = pd.DataFrame(exam_data, index=["서준", "우연", "인아"])

In [31]:
df

     수학  영어  음악 체육
서준  100  90   1  P
우연  100  91   2  F
인아  100  92   3  P

In [33]:
df[1:2]

     수학  영어  음악 체육
우연  100  91   2  F

In [34]:
df[:2]
#[1:]첫번째줄부터 마지막까지
#[:n] 0번째 줄부터 n-1번째 줄까지
#[:]0번째 줄부터 마지막 줄까지

     수학  영어  음악 체육
서준  100  90   1  P
우연  100  91   2  F

In [35]:
df2 = df[:]

In [37]:
df2.drop("우연", axis=0, inplace=True)

C:\ai\Anaconda3\lib\site-packages\pandas\core\frame.py:4102: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [38]:
df2

     수학  영어  음악 체육
서준  100  90   1  P
인아  100  92   3  P

In [39]:
df

     수학  영어  음악 체육
서준  100  90   1  P
우연  100  91   2  F
인아  100  92   3  P

In [41]:
df3 = df

In [42]:
df3.drop("우연", inplace=True)

In [43]:
df3

     수학  영어  음악 체육
서준  100  90   1  P
인아  100  92   3  P

In [44]:
df

     수학  영어  음악 체육
서준  100  90   1  P
인아  100  92   3  P

In [45]:
df4 = df[:]

In [47]:
df4.drop(["서준", "인아"], axis=0, inplace=True)

C:\ai\Anaconda3\lib\site-packages\pandas\core\frame.py:4102: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [48]:
df4

Empty DataFrame
Columns: [수학, 영어, 음악, 체육]
Index: []

In [49]:
df

     수학  영어  음악 체육
서준  100  90   1  P
인아  100  92   3  P

In [50]:
df5 = df[:]

In [51]:
df5.drop(["수학", "영어"], axis=1, inplace=True)

C:\ai\Anaconda3\lib\site-packages\pandas\core\frame.py:4102: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [52]:
df5

    음악 체육
서준   1  P
인아   3  P

In [56]:
exam_data = {
    "Math": [100, 100, 100],
    "English": [1, 2, 3],
    "Music": [10, 10, 10],
    "Physical Education": [100, 90, 80]
}

In [58]:
df =  pd.DataFrame(exam_data, index = ["서준", "우연", "인아"])

In [59]:
df

    Math  English  Music  Physical Education
서준   100        1     10                 100
우연   100        2     10                  90
인아   100        3     10                  80

In [61]:
df.loc["서준"]

Math                  100
English                 1
Music                  10
Physical Education    100
Name: 서준, dtype: int64

In [62]:
df.iloc[0]

Math                  100
English                 1
Music                  10
Physical Education    100
Name: 서준, dtype: int64

In [65]:
df.loc[["서준", "인아"]]

    Math  English  Music  Physical Education
서준   100        1     10                 100
인아   100        3     10                  80

In [66]:
df.iloc[[0, 2]]

    Math  English  Music  Physical Education
서준   100        1     10                 100
인아   100        3     10                  80

In [67]:
df.loc["서준":"인아"]

    Math  English  Music  Physical Education
서준   100        1     10                 100
우연   100        2     10                  90
인아   100        3     10                  80

In [69]:
df.iloc[0:2]

    Math  English  Music  Physical Education
서준   100        1     10                 100
우연   100        2     10                  90

In [71]:
df["Math"]

서준    100
우연    100
인아    100
Name: Math, dtype: int64

In [72]:
df.Math

서준    100
우연    100
인아    100
Name: Math, dtype: int64

In [73]:
df.English

서준    1
우연    2
인아    3
Name: English, dtype: int64

In [76]:
df[["Physical Education", "Music"]]

    Physical Education  Music
서준                 100     10
우연                  90     10
인아                  80     10

In [78]:
df[["Math"]]

    Math
서준   100
우연   100
인아   100

In [79]:
type(df[["Math"]])

pandas.core.frame.DataFrame

In [80]:
df["Math"]

서준    100
우연    100
인아    100
Name: Math, dtype: int64

In [81]:
type(df["Math"])

pandas.core.series.Series

In [82]:
df.iloc[0:3]

    Math  English  Music  Physical Education
서준   100        1     10                 100
우연   100        2     10                  90
인아   100        3     10                  80

In [83]:
df.iloc[0:3:2]

    Math  English  Music  Physical Education
서준   100        1     10                 100
인아   100        3     10                  80

In [84]:
df.iloc[:]

    Math  English  Music  Physical Education
서준   100        1     10                 100
우연   100        2     10                  90
인아   100        3     10                  80

In [85]:
df.iloc[: :-1]

    Math  English  Music  Physical Education
인아   100        3     10                  80
우연   100        2     10                  90
서준   100        1     10                 100

In [86]:
df.iloc[::-1]

    Math  English  Music  Physical Education
인아   100        3     10                  80
우연   100        2     10                  90
서준   100        1     10                 100

In [90]:
exam_data = {
    "Name": ["서준", "우연", "인아"],
    "Math": [90, 80, 70],
    "English": [98, 89, 95],
    "Music": [85, 95, 100],
    "Physical Education": [100, 90, 90]
}

In [91]:
df = pd.DataFrame(exam_data)

In [92]:
df

  Name  Math  English  Music  Physical Education
0   서준    90       98     85                 100
1   우연    80       89     95                  90
2   인아    70       95    100                  90

In [93]:
df.set_index("Name")

      Math  English  Music  Physical Education
Name
서준      90       98     85                 100
우연      80       89     95                  90
인아      70       95    100                  90

In [94]:
df

  Name  Math  English  Music  Physical Education
0   서준    90       98     85                 100
1   우연    80       89     95                  90
2   인아    70       95    100                  90

In [95]:
df.set_index("Name", inplace=True)

In [96]:
df

      Math  English  Music  Physical Education
Name
서준      90       98     85                 100
우연      80       89     95                  90
인아      70       95    100                  90

In [97]:
df.loc["서준", "Music"]

85

In [98]:
df.iloc[0][2]

85

In [99]:
df.iloc[0, 2]

85

In [100]:
df.loc["서준"]["Music"]

85

In [101]:
df.loc["서준", ["English", "Physical Education"]]

English                98
Physical Education    100
Name: 서준, dtype: int64

In [103]:
df.iloc[0, [1, 3]]

English                98
Physical Education    100
Name: 서준, dtype: int64

In [104]:
df.iloc[0, 1:3]

English    98
Music      85
Name: 서준, dtype: int64

In [105]:
dict_data = {
    "c0" : [1, 2, 3],
    "c1": [4, 5, 6]
}

In [106]:
pd.DataFrame(dict_data)

   c0  c1
0   1   4
1   2   5
2   3   6

In [107]:
df = pd.DataFrame(dict_data) #30~76

In [108]:
import pandas as pd

In [109]:
exam_data = {
    "Math": [90, 80, 70],
    "English": [98, 89, 95],
    "Music": [85, 95, 100],
    "Phsycal Education": [100, 90, 90]
}

In [110]:
df = pd.DataFrame(exam_data, index=["서준", "우현", "인아"])

In [112]:
df

    Math  English  Music  Phsycal Education
서준    90       98     85                100
우현    80       89     95                 90
인아    70       95    100                 90

In [113]:
label1 = df.loc["서준"]

In [114]:
position1 = df.iloc[0]

In [115]:
label1

Math                  90
English               98
Music                 85
Phsycal Education    100
Name: 서준, dtype: int64

In [116]:
position1

Math                  90
English               98
Music                 85
Phsycal Education    100
Name: 서준, dtype: int64

In [117]:
label2 = df.loc[["서준", "우현"]]
position2 = df.iloc[[0, 1]]

In [118]:
label2

    Math  English  Music  Phsycal Education
서준    90       98     85                100
우현    80       89     95                 90

In [119]:
position2

    Math  English  Music  Phsycal Education
서준    90       98     85                100
우현    80       89     95                 90

In [120]:
label3 = df.loc["서준":"우현"]
position3 = df.iloc[0:1]

In [121]:
label3

    Math  English  Music  Phsycal Education
서준    90       98     85                100
우현    80       89     95                 90

In [122]:
position3

    Math  English  Music  Phsycal Education
서준    90       98     85                100

In [135]:
exam_data = {
    "Name": ["서준", "우현", "인아"],
    "Math": [90, 80, 70],
    "English": [98, 89, 95],
    "Music": [85, 95, 100],
    "Physical Education": [100, 90, 90]
}

In [137]:
df = pd.DataFrame(exam_data)

In [138]:
df

  Name  Math  English  Music  Physical Education
0   서준    90       98     85                 100
1   우현    80       89     95                  90
2   인아    70       95    100                  90

In [139]:
math1 = df["Math"]

In [140]:
math1

0    90
1    80
2    70
Name: Math, dtype: int64

In [141]:
type(math1)

pandas.core.series.Series

In [142]:
english = df.English

In [143]:
english

0    98
1    89
2    95
Name: English, dtype: int64

In [144]:
type(english)

pandas.core.series.Series

In [145]:
music_gym = df[["Music", "Physical Education"]]

In [146]:
music_gym

   Music  Physical Education
0     85                 100
1     95                  90
2    100                  90

In [147]:
type(music_gym)

pandas.core.frame.DataFrame

In [148]:
math2 = df[["Math"]]

In [149]:
math2

   Math
0    90
1    80
2    70

In [150]:
type(math2)

pandas.core.frame.DataFrame

In [152]:
df.set_index("Name", inplace=True)

In [153]:
df

      Math  English  Music  Physical Education
Name
서준      90       98     85                 100
우현      80       89     95                  90
인아      70       95    100                  90

In [155]:
a = df.loc["서준", "Music"]

In [156]:
a

85

In [157]:
b = df.iloc[0, 2]

In [158]:
b

85

In [159]:
c = df.loc["서준", ["Music", "Physical Education"]]

In [160]:
c

Music                  85
Physical Education    100
Name: 서준, dtype: int64

In [161]:
d = df.iloc[0, [2, 3]]

In [162]:
d

Music                  85
Physical Education    100
Name: 서준, dtype: int64

In [163]:
e = df.loc["서준", "Music":"Physical Education"]

In [164]:
e

Music                  85
Physical Education    100
Name: 서준, dtype: int64

In [165]:
f = df.iloc[0, 2:]

In [166]:
f

Music                  85
Physical Education    100
Name: 서준, dtype: int64

In [167]:
g = df.loc[["서준", "우현"], ["Music", "Physical Education"]]

In [168]:
g

      Music  Physical Education
Name
서준       85                 100
우현       95                  90

In [169]:
h = df.iloc[[0, 1], [2, 3]]

In [170]:
h

      Music  Physical Education
Name
서준       85                 100
우현       95                  90

In [171]:
i = df.loc["서준":"우현", "Music":"Physical Education"]

In [172]:
i

      Music  Physical Education
Name
서준       85                 100
우현       95                  90

In [173]:
j = df.iloc[0:2, 2:]

In [174]:
j

      Music  Physical Education
Name
서준       85                 100
우현       95                  90

In [175]:
df["Korean"] = 80

In [176]:
df

      Math  English  Music  Physical Education  Korean
Name
서준      90       98     85                 100      80
우현      80       89     95                  90      80
인아      70       95    100                  90      80

In [180]:
exam_data = {
    "Name": ["서준", "우현", "인아"],
    "Math": [90, 80, 70],
    "English": [98, 89, 95],
    "Music": [85, 95, 100],
    "Gym": [100, 90, 90]
}

In [181]:
df = pd.DataFrame(exam_data)

In [182]:
df

  Name  Math  English  Music  Gym
0   서준    90       98     85  100
1   우현    80       89     95   90
2   인아    70       95    100   90

In [183]:
df.loc[3] = 0

In [184]:
df

  Name  Math  English  Music  Gym
0   서준    90       98     85  100
1   우현    80       89     95   90
2   인아    70       95    100   90
3    0     0        0      0    0

In [185]:
df.loc[4] = ["동규", 90, 80, 70, 60]

In [186]:
df

  Name  Math  English  Music  Gym
0   서준    90       98     85  100
1   우현    80       89     95   90
2   인아    70       95    100   90
3    0     0        0      0    0
4   동규    90       80     70   60

In [187]:
df.loc["행5"] = df.loc[3]

In [188]:
df

   Name  Math  English  Music  Gym
0    서준    90       98     85  100
1    우현    80       89     95   90
2    인아    70       95    100   90
3     0     0        0      0    0
4    동규    90       80     70   60
행5    0     0        0      0    0

In [189]:
exam_data = {
    "Name": ["서준", "우현", "인아"],
    "Math": [90, 80, 70],
    "English": [98, 89, 95],
    "Music": [85, 95, 100],
    "Gym": [100, 90, 90]
}

In [190]:
df = pd.DataFrame(exam_data)

In [191]:
df.set_index("Name", inplace=True)

In [192]:
df

      Math  English  Music  Gym
Name
서준      90       98     85  100
우현      80       89     95   90
인아      70       95    100   90

In [193]:
df.iloc[0][3] = 80

In [194]:
df

      Math  English  Music  Gym
Name
서준      90       98     85   80
우현      80       89     95   90
인아      70       95    100   90

In [195]:
df.loc["서준"]["Gym"] = 90

In [196]:
df

      Math  English  Music  Gym
Name
서준      90       98     85   90
우현      80       89     95   90
인아      70       95    100   90

In [197]:
df.loc["서준", "Gym"] = 100

In [198]:
df

      Math  English  Music  Gym
Name
서준      90       98     85  100
우현      80       89     95   90
인아      70       95    100   90

In [199]:
df.loc["서준", ["Music", "Gym"]] = 50

In [200]:
df

      Math  English  Music  Gym
Name
서준      90       98     50   50
우현      80       89     95   90
인아      70       95    100   90

In [201]:
df.loc["서준", ["Music", "Gym"]] = 100, 50

In [202]:
df

      Math  English  Music  Gym
Name
서준      90       98    100   50
우현      80       89     95   90
인아      70       95    100   90

In [203]:
exam_data = {
    "Name": ["서준", "우현", "인아"],
    "Math": [90, 80, 70],
    "English": [98, 89, 95],
    "Music": [85, 95, 100],
    "Gym": [100, 90, 90]
}

In [204]:
df = pd.DataFrame(exam_data)

In [205]:
df

  Name  Math  English  Music  Gym
0   서준    90       98     85  100
1   우현    80       89     95   90
2   인아    70       95    100   90

In [206]:
df = df.transpose()

In [207]:
df

           0   1    2
Name      서준  우현   인아
Math      90  80   70
English   98  89   95
Music     85  95  100
Gym      100  90   90

In [208]:
df = df.T

In [209]:
df

  Name Math English Music  Gym
0   서준   90      98    85  100
1   우현   80      89    95   90
2   인아   70      95   100   90

In [210]:
ndf = df.set_index(["Name"])

In [211]:
ndf

     Math English Music  Gym
Name
서준     90      98    85  100
우현     80      89    95   90
인아     70      95   100   90

In [212]:
ndf2 = ndf.set_index("Music")

In [213]:
ndf2

      Math English  Gym
Music
85      90      98  100
95      80      89   90
100     70      95   90

In [214]:
ndf3 = ndf.set_index(["Math", "Music"])

In [215]:
ndf3

           English  Gym
Math Music
90   85         98  100
80   95         89   90
70   100        95   90

In [216]:
dict_data = {
    "c0": [1, 2, 3],
    "c1": [4, 5, 6],
    "c2": [7, 8, 9],
    "c3": [10, 11, 12],
    "c4": [13, 14, 15]
}

In [218]:
df = pd.DataFrame(dict_data, index = ["r0", "r1", "r2"])

In [219]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [220]:
new_index = ["r0", "r1", "r2", "r3", "r4"]

In [221]:
ndf = df.reindex(new_index)

In [222]:
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [223]:
ndf2 = df.reindex(new_index, fill_value=0)

In [224]:
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [225]:
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [226]:
df = pd.DataFrame(dict_data, index=["r0", "r1", "r2"])

In [227]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [228]:
ndf = df.reset_index()

In [229]:
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [230]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [231]:
ndf = df.sort_index(ascending=False)

In [232]:
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [233]:
student1 = pd.Series({"Korean": 100, "English": 80, "Math": 90})

In [234]:
student1

Korean     100
English     80
Math        90
dtype: int64

In [235]:
percentage = student1/200

In [236]:
percentage

Korean     0.50
English    0.40
Math       0.45
dtype: float64

In [237]:
type(percentage)

pandas.core.series.Series

In [238]:
student2 = pd.Series({"Math": 80, "Korean": 90, "English": 80})

In [239]:
student1

Korean     100
English     80
Math        90
dtype: int64

In [240]:
student2

Math       80
Korean     90
English    80
dtype: int64

In [243]:
addition = student1 + student2
substraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2

In [244]:
type(division)

pandas.core.series.Series

In [245]:
result = pd.DataFrame([addition, substraction, multiplication, division], index=["+", "-", "*", "%"])

In [246]:
result

   English       Korean      Math
+    160.0   190.000000   170.000
-      0.0    10.000000    10.000
*   6400.0  9000.000000  7200.000
%      1.0     1.111111     1.125

In [247]:
import numpy as np

In [248]:
student1 = pd.Series({"Korean":np.nan, "English": 80, "Math": 90})
student2 = pd.Series({"Math": 80, "Korean": 90})

In [255]:
student1

Korean      NaN
English    80.0
Math       90.0
dtype: float64

In [256]:
student2

Math      80
Korean    90
dtype: int64

In [257]:
addition = student1 + student2
substraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2

In [258]:
result = pd.DataFrame([addition, substraction, multiplication, division], index=["+", "-", "x", "%"])

In [259]:
result

   English  Korean      Math
+      NaN     NaN   170.000
-      NaN     NaN    10.000
x      NaN     NaN  7200.000
%      NaN     NaN     1.125